Ran `terragrunt apply -replace="module.certificate.aws_acm_certificate.cert"`.

Plan:
```
Terraform will perform the following actions:
    16:01:22.298 STDOUT terraform:   # module.certificate.aws_acm_certificate.cert will be replaced, as requested
    16:01:22.298 STDOUT terraform: +/- resource "aws_acm_certificate" "cert" {
    16:01:22.298 STDOUT terraform:       ~ arn                       = "arn:aws:acm:us-east-1:519825364412:certificate/71aff3c0-3d06-4f00-830a-4cce4d6785f0" -> (known after apply)
    16:01:22.298 STDOUT terraform:       ~ domain_validation_options = [
    16:01:22.298 STDOUT terraform:           - {
    16:01:22.298 STDOUT terraform:               - domain_name           = "ecs.docs-rs-staging.rust-lang.net"
    16:01:22.298 STDOUT terraform:               - resource_record_name  = "_1868bcc9fc48ce3e1502ecac958d0905.ecs.docs-rs-staging.rust-lang.net."
    16:01:22.298 STDOUT terraform:               - resource_record_type  = "CNAME"
    16:01:22.298 STDOUT terraform:               - resource_record_value = "_14e643599a8c0e86db8eae80238bf5de.fmfdpfvvyn.acm-validations.aws."
    16:01:22.298 STDOUT terraform:             },
    16:01:22.298 STDOUT terraform:           + {
    16:01:22.298 STDOUT terraform:               + domain_name           = "ecs.docs-rs-staging.rust-lang.net"
    16:01:22.298 STDOUT terraform:               + resource_record_name  = (known after apply)
    16:01:22.298 STDOUT terraform:               + resource_record_type  = (known after apply)
    16:01:22.298 STDOUT terraform:               + resource_record_value = (known after apply)
    16:01:22.298 STDOUT terraform:             },
    16:01:22.298 STDOUT terraform:         ]
    16:01:22.298 STDOUT terraform:       ~ id                        = "arn:aws:acm:us-east-1:519825364412:certificate/71aff3c0-3d06-4f00-830a-4cce4d6785f0" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ key_algorithm             = "RSA_2048" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ not_after                 = "2024-02-11T23:59:59Z" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ not_before                = "2023-01-13T00:00:00Z" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ pending_renewal           = false -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ renewal_summary           = [] -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ status                    = "EXPIRED" -> (known after apply)
    16:01:22.299 STDOUT terraform:       - tags                      = {} -> null
    16:01:22.299 STDOUT terraform:       ~ tags_all                  = {} -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ type                      = "AMAZON_ISSUED" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ validation_emails         = [] -> (known after apply)
    16:01:22.299 STDOUT terraform:         # (3 unchanged attributes hidden)
    16:01:22.299 STDOUT terraform:       - options {
    16:01:22.299 STDOUT terraform:           - certificate_transparency_logging_preference = "ENABLED" -> null
    16:01:22.299 STDOUT terraform:         }
    16:01:22.299 STDOUT terraform:     }
    16:01:22.299 STDOUT terraform:   # module.certificate.aws_acm_certificate_validation.cert will be created
    16:01:22.299 STDOUT terraform:   + resource "aws_acm_certificate_validation" "cert" {
    16:01:22.299 STDOUT terraform:       + certificate_arn         = (known after apply)
    16:01:22.299 STDOUT terraform:       + id                      = (known after apply)
    16:01:22.299 STDOUT terraform:       + validation_record_fqdns = (known after apply)
    16:01:22.299 STDOUT terraform:     }
    16:01:22.299 STDOUT terraform:   # module.certificate.aws_route53_record.cert_validation["ecs.docs-rs-staging.rust-lang.net"] must be replaced
    16:01:22.299 STDOUT terraform: -/+ resource "aws_route53_record" "cert_validation" {
    16:01:22.299 STDOUT terraform:       ~ fqdn                             = "_1868bcc9fc48ce3e1502ecac958d0905.ecs.docs-rs-staging.rust-lang.net" -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ id                               = "Z041605467FBG83G9AI2__1868bcc9fc48ce3e1502ecac958d0905.ecs.docs-rs-staging.rust-lang.net._CNAME" -> (known after apply)
    16:01:22.299 STDOUT terraform:       - multivalue_answer_routing_policy = false -> null
    16:01:22.299 STDOUT terraform:       ~ name                             = "_1868bcc9fc48ce3e1502ecac958d0905.ecs.docs-rs-staging.rust-lang.net" # forces replacement -> (known after apply) # forces replacement
    16:01:22.299 STDOUT terraform:       ~ records                          = [
    16:01:22.299 STDOUT terraform:           - "_14e643599a8c0e86db8eae80238bf5de.fmfdpfvvyn.acm-validations.aws.",
    16:01:22.299 STDOUT terraform:         ] -> (known after apply)
    16:01:22.299 STDOUT terraform:       ~ type                             = "CNAME" -> (known after apply)
    16:01:22.299 STDOUT terraform:         # (3 unchanged attributes hidden)
    16:01:22.300 STDOUT terraform:     }
    16:01:22.300 STDOUT terraform: Plan: 3 to add, 0 to change, 2 to destroy.
```